In [1]:
print("Hello Amit")

Hello Amit

## SQL is a language

In [ ]:
import sqlite3

# create database in memory  (temporary, disappears after program ends)
conn = sqlite3.connect('newtry.db')

# create a cursor (to run queries)
cur = conn.cursor()

In [6]:
# create a table
cur.execute('''CREATE TABLE students1(
            id INTEGER PRIMARY KEY, 
            name TEXT, 
            age INTEGER,
            city TEXT,
            joining_date TEXT not null
            )'''
            )

In [8]:
cur.execute("INSERT INTO students1 (name, age, city,joining_date) VALUES ('Amit', 24, 'Delhi','2023-06-01')," \
"('John', 22, 'New York','2023-06-02')," \
"('Sara', 23, 'London','2023-06-03')," \
"('Maria', 21, 'Sydney','2023-06-04')")
conn.commit()

In [42]:
cur.execute("INSERT INTO students1 (name, age, city,joining_date) VALUES ('Adarsh', 21, 'gkp','2004-06-01')")
conn.commit()

In [12]:
cur.execute("select * from students1")
rows = cur.fetchall()
rows

[(1, 'Amit', 24, 'Delhi', '2023-06-01'),
 (2, 'John', 22, 'New York', '2023-06-02'),
 (3, 'Sara', 23, 'London', '2023-06-03'),
 (4, 'Maria', 21, 'Sydney', '2023-06-04'),
 (5, 'Vishal', 26, 'gkp', '1999-06-01')]

In [ ]:
cur.execute("SELECT age FROM students1")
# cur.fetchall() # list of ages
for row in cur.fetchall():
    print(row)

[(24,), (22,), (23,), (21,), (26,)]

In [ ]:
cur.execute("SELECT * FROM students1 where city = 'gkp'") # get all details of students from gkp
cur.fetchall()

[(5, 'Vishal', 26, 'gkp', '1999-06-01')]

In [23]:
cur.execute("SELECT joining_date FROM students1 where joining_date > '2022-01-01' order by age") # get joining date of students from gkp
for row in cur.fetchall():
    print(row)

('2023-06-04',)
('2023-06-02',)
('2023-06-03',)
('2023-06-01',)

### Question :

In [28]:
cur.execute("SELECT * FROM students1 where city in ('gkp','Delhi');") # get all details of students from gkp
for row in cur.fetchall():
    print(row)

(1, 'Amit', 24, 'Delhi', '2023-06-01')
(5, 'Vishal', 26, 'gkp', '1999-06-01')

## Part 2: Aggregations & Functions...

In [29]:
# 1) create payments table
cur.execute("""
CREATE TABLE IF NOT EXISTS payments (
    id INTEGER PRIMARY KEY,
    student_id INTEGER,
    amount REAL,
    pay_date DATE
);
""")

In [30]:
# 2) insert sample data
cur.executemany("""
INSERT INTO payments (id, student_id, amount, pay_date) VALUES (?, ?, ?, ?)
""", [
    (1, 1, 1200.0, '2025-01-15'),
    (2, 2, 1500.0, '2025-02-10'),
    (3, 1, 800.0,  '2025-02-20'),
    (4, 3, 1500.0, '2025-03-20'),
    (5, 4, 1000.0, '2025-04-22'),
    (6, 2, 500.0,  '2025-04-25'),
])
conn.commit()

In [35]:
cur.execute("SELECT city ,count(*) AS total_students FROM students1 group by city order by age DESC ;")
for row in cur.fetchall():
    print(row)

('gkp', 1)
('Delhi', 1)
('London', 1)
('New York', 1)
('Sydney', 1)

In [41]:
cur.execute("""
SELECT student_id, SUM(amount) AS total_paid
FROM payments
GROUP BY student_id
ORDER BY total_paid DESC;
""")
for row in cur.fetchall():
    print(row)

(2, 2000.0)
(1, 2000.0)
(3, 1500.0)
(4, 1000.0)

In [38]:
cur.execute("SELECT * FROM payments")
for row in cur.fetchall():
    print(row)

(1, 1, 1200.0, '2025-01-15')
(2, 2, 1500.0, '2025-02-10')
(3, 1, 800.0, '2025-02-20')
(4, 3, 1500.0, '2025-03-20')
(5, 4, 1000.0, '2025-04-22')
(6, 2, 500.0, '2025-04-25')

In [39]:
cur.execute("SELECT AVG(amount) FROM payments;")
print(cur.fetchall())

[(1083.3333333333333,)]

## Having and Groupby

In [50]:
cur.execute("""
SELECT city, COUNT(*) AS total_students1
FROM students
GROUP BY city
HAVING COUNT(*) >= 2;
""")
print(cur.fetchall())

[('New York', 2)]